УТ_для_edt/src/Catalogs/CRM_ТипыОбращений/CRM_ТипыОбращений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ТипыОбращений</name>
  <predefined>
    <items>
      <name>Интерес</name>
      <description>Интерес</description>
    </items>
    <items>
      <name>Обращение</name>
      <description>Обращение</description>
    </items>
  </predefined>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения/ДополнительныеРеквизитыИСведения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ДополнительныеРеквизитыИСведения</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    <types>CatalogRef.Валюты</types>
    <types>CatalogRef.СегментыПартнеров</types>
    <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектовИерархия</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>Boolean</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
    <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.Файлы</types>
    <types>CatalogRef.Партнеры</types>
    <types>String</types>
    <types>Date</types>
    <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    <types>CatalogRef.СтраныМира</types>
    <types>Number</types>
    <types>CatalogRef.НаправленияДеятельности</types>
    <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.СегментыНоменклатуры</types>
    <types>CatalogRef.БизнесРегионы</types>
    <types>CatalogRef.CRM_Сайты</types>
    <types>CatalogRef.Проекты</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.CRM_Отрасли</types>
    <types>CatalogRef.УдалитьCRM_ТипыОтношений</types>
    <numberQualifiers>
      <precision>17</precision>
      <scale>5</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>1024</length>
    </stringQualifiers>
  </type>
  <attributes>
    <name>Виден</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецДополнительныхЗначений</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьВВидеГиперссылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияИспользуются</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеЗначенияСВесом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доступен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыВыбораЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокФормыЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнятьОбязательно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МногострочноеПолеВвода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подсказка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматСвойства</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДополнительноеСведение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗависимостиДополнительныхРеквизитов</name>
    <attributes>
      <name>ЗависимоеСвойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаборСвойств</name>
      <type>
        <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>String</types>
        <stringQualifiers>
          <length>99</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заголовок</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подсказка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаголовокФормыВыбораЗначения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

УТ_для_edt/src/CommonModules/CRM_УправлениеСвойствамиПереопределяемый/Module.bsl
#Область ПрограммныйИнтерфейс

// Заполняет наборы свойств объекта. Обычно требуется, если наборов более одного.
//
// Параметры:
//  Объект       - ЛюбаяСсылка      - Ссылка на объект со свойствами.
//               - ФормаКлиентскогоПриложения - Форма объекта, к которому подключены свойства.
//               - ДанныеФормыСтруктура - Описание объекта, к которому подключены свойства.
//
//  ТипСсылки    - Тип - тип ссылки владельца свойств.
//
//  НаборыСвойств - ТаблицаЗначений - с колонками:
//                    Набор - СправочникСсылка.НаборыДополнительныхРеквизитовИСведений.
//                    ОбщийНабор - Булево - Истина, если набор свойств содержит свойства,
//                     общие для всех объектов.
//                    // Далее свойства элемента формы типа ГруппаФормы вида обычная группа
//                    // или страница, которая создается, если наборов больше одного без учета
//                    // пустого набора, который описывает свойства группы удаленных реквизитов.
//                    
//                    // Если значение Неопределено, значит использовать значение по умолчанию.
//                    
//                    // Для любой группы управляемой формы.
//                    Высота                   - Число.
//                    Заголовок                - Строка.
//                    Подсказка                - Строка.
//                    РастягиватьПоВертикали   - Булево.
//                    РастягиватьПоГоризонтали - Булево.
//                    ТолькоПросмотр           - Булево.
//                    ЦветТекстаЗаголовка      - Цвет.
//                    Ширина                   - Число.
//                    ШрифтЗаголовка           - Шрифт.
//                    
//                    // Для обычной группы и страницы.
//                    Группировка              - ГруппировкаПодчиненныхЭлементовФормы.
//                    
//                    // Для обычной группы.
//                    Отображение              - ОтображениеОбычнойГруппы.
//                    
//                    // Для страницы.
//                    Картинка                 - Картинка.
//                    ОтображатьЗаголовок      - Булево.
//
//  СтандартнаяОбработка - Булево - начальное значение Истина. Указывает получать ли
//                         основной набор, когда НаборыСвойств.Количество() равно нулю.
//
//  КлючНазначения   - Неопределено - (начальное значение) - указывает вычислить
//                      ключ назначения автоматически и добавить к значениям свойств
//                      формы КлючНазначенияИспользования и КлючСохраненияПоложенияОкна,
//                      чтобы изменения формы (настройки, положение и размер) сохранялись
//                      отдельно для разного состава наборов.
//                      Например, для каждого вида номенклатуры - свой состав наборов.
//
//                    - Строка - (не более 32 символа) - использовать указанный ключ
//                      назначения для добавления к значениям свойств формы.
//                      Пустая строка - не изменять свойства ключей формы, т.к. они
//                      устанавливается в форме и уже учитывают различия состава наборов.
//
//                    Добавка имеет формат "КлючНаборовСвойств<КлючНазначения>",
//                    чтобы <КлючНазначения> можно было обновлять без повторной добавки.
//                    При автоматическом вычислении <КлючНазначения> содержит хэш
//                    идентификаторов ссылок упорядоченных наборов свойств.
//
Процедура ЗаполнитьНаборыСвойствОбъекта(Объект, ТипСсылки, НаборыСвойств, СтандартнаяОбработка, КлючНазначения) Экспорт
	
	ТипЗначения = ТипЗнч(Объект);
	Если (ТипЗначения = Тип("СправочникСсылка.Партнеры")
		ИЛИ ТипЗначения = Тип("СправочникОбъект.Партнеры")
		ИЛИ ТипСсылки = Тип("СправочникСсылка.Партнеры")) Тогда
		
		СписокСвойств = ПолучитьНаборыСвойствДляПартнеров(Объект.ЮрФизЛицо);
		
	ИначеЕсли (ТипЗначения = Тип("ДокументСсылка.CRM_Интерес")
		ИЛИ ТипЗначения = Тип("ДокументСсылка.CRM_Интерес")
		ИЛИ ТипСсылки = Тип("ДокументСсылка.CRM_Интерес")) Тогда
		
		СписокСвойств = ПолучитьНаборыСвойствДляИнтересов(Объект.ТипОбращения);
		
	ИначеЕсли ТипСсылки = Тип("СправочникСсылка.CRM_КартыМаршрутов") Тогда
		
		СписокСвойств = ПолучитьНаборыСвойствДляКартМаршрута(Объект);
		
	ИначеЕсли ТипСсылки = Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс") Тогда
		Если ЗначениеЗаполнено(Объект.КартаМаршрута) Тогда
			
			СписокСвойств = ПолучитьНаборыСвойствДляКартМаршрута(Объект.КартаМаршрута);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
	ИначеЕсли ТипСсылки = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда
		
		Если ЗначениеЗаполнено(Объект.БизнесПроцесс)
		И (ТипЗнч(Объект.БизнесПроцесс)=Тип("БизнесПроцессСсылка.CRM_БизнесПроцесс")) Тогда
			
			СписокСвойств = ПолучитьНаборыСвойствДляКартМаршрута(Объект.БизнесПроцесс.КартаМаршрута);
		Иначе
			
			Возврат;
			
		КонецЕсли;
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ЭлементСписка Из СписокСвойств Цикл
		
		СтрокаНабора = НаборыСвойств.Добавить();
		
		СтрокаНабора.Набор 	   = ЭлементСписка.Значение;
		СтрокаНабора.Заголовок = ЭлементСписка.Представление;
		
	КонецЦикла;
	
КонецПроцедуры


// Получает наборы свойств для карт маршрута.
//
// Параметры:
//  Объект	 - ЛюбойТип	 - Объект.
// 
// Возвращаемое значение:
//  СписокЗначений - Наборы свойств для карт маршрута.
//
Функция ПолучитьНаборыСвойствДляКартМаршрута(Объект) Экспорт
	
	Наборы = Новый СписокЗначений;
	
	НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_CRM_КартыМаршрутов_Общие;
	Наборы.Добавить(НаборСвойств, НСтр("ru='Общие свойства';en='Common properties'"));
	
	НаборСвойств = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "НаборСвойств");
	Наборы.Добавить(НаборСвойств, НСтр("ru='Свойства карты маршрута';en='Flow Chart Properties'"));
	
	Возврат Наборы;
	
КонецФункции // ПолучитьНаборыСвойствДляКартМаршрута()

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ СО СПРАВОЧНИКОМ ПАРТНЕРЫ

// Получить наборы свойств для партнеров
//
// Параметры:
//  ВидПартнера	 - ПеречислениеСсылка.КомпанияЧастноеЛицо - Вид партнера
// 
// Возвращаемое значение:
//  СписокЗначений - Наборы свойств. 
//
Функция ПолучитьНаборыСвойствДляПартнеров(ВидПартнера) Экспорт
	Наборы = Новый СписокЗначений;
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Общие, НСтр("ru='Общие для всех партнеров';en='Common for all partners'"));
	КонецЕсли;
	Если ВидПартнера = Перечисления.КомпанияЧастноеЛицо.Компания Тогда
		Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_Компании_CRM,    НСтр("ru='Для компаний';en='For the companies'"));
	ИначеЕсли ВидПартнера = Перечисления.КомпанияЧастноеЛицо.ЧастноеЛицо Тогда
		Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Партнеры_ЧастныеЛица_CRM, НСтр("ru='Для частных лиц';en='For private persons'"));
	КонецЕсли;
	Возврат Наборы;
КонецФункции // ПолучитьНаборыСвойствДляПартнеров()

////////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ СО СПРАВОЧНИКОМ ПАРТНЕРЫ

// Получить наборы свойств номенклатуры
//
// Параметры:
//  НоменклатурнаяГруппа - СправочникСсылка.НоменклатурныеГруппы - Номенклатурная группа.
// 
// Возвращаемое значение:
//  СписокЗначений - Наборы свойств номенклатуры.
//
Функция ПолучитьНаборыСвойствНоменклатуры(НоменклатурнаяГруппа = Неопределено) Экспорт
	Наборы = Новый СписокЗначений;
	Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура, НСтр("ru='Общие для номенклатуры';en='Nomenclature common'"));
	Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		Наборы.Добавить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоменклатурнаяГруппа, "НаборСвойствХарактеристики"), НСтр("ru='Для номенклатурной группы';en='For nomenclature group'"));
	КонецЕсли;
	Возврат Наборы;
КонецФункции // ПолучитьНаборыСвойствДляПартнеров()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ CRM

// Получить наборы свойств для партнеров.
//
// Параметры:
//  ТипОбращения - СправочникСсылка.CRM_ТипыОбращений - тип обращения.
// 
// Возвращаемое значение:
//  СписокЗначений - Наборы свойств. 
//
Функция ПолучитьНаборыСвойствДляИнтересов(ТипОбращения) Экспорт
	Наборы = Новый СписокЗначений;
	Если ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес Тогда
		Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес_Интерес,    НСтр("ru='Для интересов с типом Интерес'"));
	Иначе
		Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес_ВсеОбращения, НСтр("ru='Общие для всех обращений'"));
		Если ТипОбращения = Справочники.CRM_ТипыОбращений.Обращение Тогда
			Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_CRM_Интерес_Обращение,    НСтр("ru='Обращение'"));
		Иначе
			Наборы.Добавить(Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоНаименованию(ТипОбращения.Наименование), НСтр("ru='Для интересов с типом'")+ " " + ТипОбращения.Наименование);
		КонецЕсли;
	КонецЕсли;
	Возврат Наборы;
КонецФункции // ПолучитьНаборыСвойствДляПартнеров()

// Скопировать нужные строки из сформированного дерева значений свойств в другое дерево.
//
Процедура СкопироватьДеревоЗначенийСтрок(СтрокиКуда, СтрокиОткуда, Родитель)

	Для Каждого Стр Из СтрокиОткуда Цикл
		Если Стр.Свойство = Родитель Тогда
			СкопироватьДеревоЗначенийСтрок(СтрокиКуда, Стр.Строки, Стр.Свойство);
		Иначе
			новСтр = СтрокиКуда.Добавить();
			ЗаполнитьЗначенияСвойств(новСтр, Стр);
			СкопироватьДеревоЗначенийСтрок(новСтр.Строки, Стр.Строки, Стр.Свойство);
		КонецЕсли;

		СтрокиКуда.Сортировать("ЭтоГруппа УБЫВ");
	КонецЦикла;

КонецПроцедуры // СкопироватьДеревоЗначенийСтрок()

// Сформировать дерево значений свойств для редактирования в форме объекта.
//
Функция ПолучитьДеревоДляРедактированияЗначенийСвойств(спсНаборов, табСвойств, ДляДопРеквизитов)
	спсВыбраны = Новый СписокЗначений;
	Для Каждого Стр Из табСвойств Цикл
		Если спсНаборов.НайтиПоЗначению(Стр.Свойство) = Неопределено Тогда
			спсВыбраны.Добавить(Стр.Свойство);
		КонецЕсли;
	КонецЦикла;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство,
	|	ДополнительныеРеквизитыИСведения.ТипЗначения КАК ТипЗначенияСвойства,
	|	ЛОЖЬ КАК ЭтоГруппа,
	|	ДополнительныеРеквизитыИСведения.ФорматСвойства КАК ФорматСвойства,
	|	Свойства.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА Свойства.Ошибка
	|			ТОГДА 1
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК НомерКартинки
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			НаборыСвойствСостав.Свойство КАК Свойство,
	|			ЛОЖЬ КАК Ошибка,
	|			НаборыСвойствСостав.НомерСтроки КАК НомерСтроки
	|		ИЗ
	|			Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыСвойствСостав
	|		ГДЕ
	|			НаборыСвойствСостав.Ссылка В(&спсНаборов)
	|			И НаборыСвойствСостав.Свойство.ЭтоДополнительноеСведение = &ЭтоДополнительноеСведение
	|		
	|		ОБЪЕДИНИТЬ
	|		
	|		ВЫБРАТЬ
	|			ДополнительныеРеквизитыИСведения.Ссылка,
	|			ИСТИНА,
	|			НаборыСвойствСостав.НомерСтроки
	|		ИЗ
	|			ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НаборыСвойствСостав
	|				ПО (НаборыСвойствСостав.Свойство = ДополнительныеРеквизитыИСведения.Ссылка)
	|					И (НаборыСвойствСостав.Ссылка В (&спсНаборов))
	|		ГДЕ
	|			ДополнительныеРеквизитыИСведения.Ссылка В(&спсВыбраны)
	|			И (НаборыСвойствСостав.Ссылка ЕСТЬ NULL 
	|					ИЛИ ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение <> &ЭтоДополнительноеСведение)) КАК Свойства
	|		ПО ДополнительныеРеквизитыИСведения.Ссылка = Свойства.Свойство
	|
	|УПОРЯДОЧИТЬ ПО
	|	Свойства.НомерСтроки";
	//|ИТОГИ ПО
	//|	Свойство ТОЛЬКО ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("ЭтоДополнительноеСведение", НЕ ДляДопРеквизитов);
	Запрос.УстановитьПараметр("спсНаборов", спсНаборов);
	Запрос.УстановитьПараметр("спсВыбраны", спсВыбраны);
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Дерево.Колонки.Вставить(2, "Значение", Метаданные.ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.Тип);
	новДерево = Новый ДеревоЗначений;
	Для Каждого Колонка Из Дерево.Колонки Цикл
		новДерево.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);
	КонецЦикла;
	СкопироватьДеревоЗначенийСтрок(новДерево.Строки, Дерево.Строки, ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПустаяСсылка());
	Для Каждого Стр Из табСвойств Цикл
		СтрД = новДерево.Строки.Найти(Стр.Свойство, "Свойство", Истина);
		Если НЕ (СтрД = Неопределено) Тогда
			СтрД.Значение = Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат новДерево;
КонецФункции // ПолучитьДеревоДляРедактированияЗначенийСвойств()

// Заполнить дерево значений свойств на форме объекта.
//
// Параметры:
//  Ссылка						 - СправочникСсылка	 -  Ссылка на объект.
//  ДополнительныеРеквизиты		 - ТабличныеЧасти - Дополнительные реквизиты.
//  ДляДополнительныхРеквизитов	 - Булево - Признак дополнительного реквизита. 
//  Наборы						 - СписокЗначений - Наборы.
// 
// Возвращаемое значение:
//  ДеревоЗначений - Заполненное дерево значений.
//
Функция ЗаполнитьДеревоЗначенийСвойств(Ссылка, ДополнительныеРеквизиты, ДляДополнительныхРеквизитов, Наборы) Экспорт
	Если ТипЗнч(Наборы) = Тип("СписокЗначений") Тогда
		спсНаборов = Наборы;
	Иначе
		спсНаборов = Новый СписокЗначений;
		Если НЕ (Наборы = Неопределено) Тогда
			спсНаборов.Добавить(Наборы);
		КонецЕсли;
	КонецЕсли;
	Дерево = ПолучитьДеревоДляРедактированияЗначенийСвойств(спсНаборов, ДополнительныеРеквизиты, ДляДополнительныхРеквизитов);
	Возврат Дерево;
КонецФункции // ЗаполнитьДеревоЗначенийСвойств()

// По строкам дерева значений свойств заполнить соответствие не пустыми значениями.
//
Процедура ЗаполнитьЗначенияСвойствИзДерева(СтрокиДерева, Значения)
	Для Каждого Стр Из СтрокиДерева Цикл
		Если Стр.ЭтоГруппа Тогда
			ЗаполнитьЗначенияСвойствИзДерева(Стр.Строки, Значения);
		ИначеЕсли ЗначениеЗаполнено(Стр.Значение) Тогда
			Значения.Вставить(Стр.Свойство, Стр.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьЗначенияСвойствИзДерева() 

// Из дерева значений свойств на форме заполнить табличную часть объекта значений свойств.
//
// Параметры:
//  ДополнительныеРеквизиты	 - ТабличныеЧасти - Дополнительные реквизиты.
//  ДеревоСвойств			 - ДеревоЗначений - Дерево значений. 
//
Процедура ПеренестиЗначенияСвойств(ДополнительныеРеквизиты, ДеревоСвойств) Экспорт
	Значения = Новый Соответствие;
	ЗаполнитьЗначенияСвойствИзДерева(ДеревоСвойств.Строки, Значения);
	ДополнительныеРеквизиты.Очистить();
	Для Каждого Стр Из Значения Цикл
		новСтр = ДополнительныеРеквизиты.Добавить();
		новСтр.Свойство = Стр.Ключ;
		новСтр.Значение = Стр.Значение;
	КонецЦикла;
КонецПроцедуры // ПеренестиЗначенияСвойств()

#КонецОбласти
